[
  {
    "by": "gsf_emergency_2",
    "id": 44477779,
    "kids": [
      44478644
    ],
    "parent": 44477367,
    "text": "&gt;<i>where the highest D country in the world (China)</i><p>Are you referring to the D in DISC?<p><a href=\"https:&#x2F;&#x2F;blog.assessments24x7.com&#x2F;disc-world-map&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;blog.assessments24x7.com&#x2F;disc-world-map&#x2F;</a><p>I don&#x27;t know about China (roughly on par with US in that link), but the other high-D countries (languages) make sense to me in your take<p>Russian Turkish, Indonesian, Hungarian, even Dutch..<p>Edit: found a country table for Machiavellianism&#x2F;narcissism, I don&#x27;t fully understand what it says, but numbers columns &quot;M&quot; (mildly) correlates with &quot;D&quot; above. (Ireland is a surprise??!! Turkey, I assume foul play by authors lol)<p><a href=\"https:&#x2F;&#x2F;www.researchgate.net&#x2F;figure&#x2F;Descriptive-statistics-of-dark-triad-traits-by-country_tbl1_349821893\" rel=\"nofollow\">https:&#x2F;&#x2F;www.researchgate.net&#x2F;figure&#x2F;Descriptive-statistics-o...</a><p>Maybe you have a more reliable source?",
    "time": 1751775214,
    "type": "comment"
  },
  {
    "by": "iw7tdb2kqo9",
    "id": 44716061,
    "kids": [
      44716091
    ],
    "parent": 44715823,
    "text": "you detached&#x2F;flagged my comment from thread, shadow banned my account and disabled signup in my IP because I said something against them. That was &quot;clearly&quot; enough.",
    "time": 1753739080,
    "type": "comment"
  },
  {
    "by": "walterlw",
    "id": 44345246,
    "kids": [
      44346274
    ],
    "parent": 44345079,
    "text": "Biden took the approach of keeping 10 pairs of gloves on when dealing with Russia. Don&#x27;t help too little not to make it too easy for the russians, don&#x27;t help to much to avoid escalation.",
    "time": 1750582645,
    "type": "comment"
  },
  {
    "by": "PaulHoule",
    "id": 44210937,
    "parent": 44210796,
    "text": "Good catch!  I fixed it.",
    "time": 1749316044,
    "type": "comment"
  },
  {
    "by": "petethomas",
    "descendants": 0,
    "id": 44448882,
    "score": 2,
    "time": 1751490692,
    "title": "Tech venture firms deploy private equity 'roll-up' strategy",
    "type": "story",
    "url": "https://www.ft.com/content/74db4959-5980-4ca3-8a46-f058ef477411"
  },
  {
    "by": "crote",
    "id": 44448403,
    "kids": [
      44449161,
      44455236
    ],
    "parent": 44445959,
    "text": "&gt; officers who put their lives on the line every day<p>This sounds a lot less impressive when you realize that cops have the same fatal injury rate as landscaping supervisors or crane operators, less than half the rate of garbage collectors, and <i>one-sixth</i> the rate of logging workers.<p>There&#x27;s definitely a decent bit of risk involved in being a cop, but we&#x27;re not exactly seeing Thin Green Line flags for landscapers either, are we?",
    "time": 1751487787,
    "type": "comment"
  },
  {
    "by": "PseudoComputer",
    "id": 44780902,
    "parent": 44776132,
    "text": "I think Stirling PDF is a great product, but there meant for more Enterprise level users. LuxPDF is meant for very quick file conversions or modifications and is geared towards freelancers, students, small business etc.",
    "time": 1754265554,
    "type": "comment"
  },
  {
    "by": "duxup",
    "id": 44653782,
    "parent": 44653444,
    "text": "It seems to be one of those &quot;computer told me there are bad people here, this is easy&quot; kinda thing.  Serious police work is hard ... this seems like the local police putting resources into what is easy.",
    "time": 1753223604,
    "type": "comment"
  },
  {
    "by": "teddyh",
    "id": 44906365,
    "kids": [
      44908433,
      44935468
    ],
    "parent": 44900344,
    "text": "&gt; <i>Gollum looks wrong too for that matter.</i><p>“Down the face of a precipice, sheer and almost smooth it seemed in the pale moonlight, a small black shape was moving with its thin limbs splayed out. […] The black crawling shape was now three-quarters of the way down, and perhaps fifty feet or less above the cliff&#x27;s foot.[…] They peered down at the dark pool. A little black head appeared at the far end of the basin, just out of the deep shadow of the rocks.”<p>No visual version of Tolkien’s works could ever be made now which depicts Gollum accurately.",
    "time": 1755210009,
    "type": "comment"
  },
  {
    "by": "vdupras",
    "id": 44835699,
    "parent": 44835287,
    "text": "A few new facts we&#x27;ll see pop up:<p>1. There has always been town-destroying wildfires every summer. It&#x27;s always been like that.<p>2. It has always been the case that AC units were necessary for a human to survive an american summer. I mean, look at native americans, they always had AC units!<p>3. Los Angeles always flash flooded 10 feet up across every summer.<p>4. America has always been at war with Canada.<p>5. Wildfire smoke across the sky for the whole damn summer? Always been thus. What do you mean, blue?",
    "time": 1754651613,
    "type": "comment"
  },
  {
    "by": "tzs",
    "id": 44916001,
    "parent": 44912300,
    "text": "I don&#x27;t know if the German politicians are actually doing this, but good politicians should be considering the big picture.<p>The big picture includes:<p>• A large majority of the politician&#x27;s constituents each regularly use several large websites that cost a lot of money to run, and the constituents would be upset if those sites went away. Someone has to pay for those sites. Ads are the most common way that is currently done.<p>• Almost nobody likes ads other than in some exceptional cases [1].<p>• Most people dislike paid subscriptions. This dislike grows exponentially as the number of subscriptions they need to cover the content they want goes up.<p>• Many people think they would like micropayments but would likely change their mind once that actually became an options. If people have to pay money they tend to greatly prefer predictable monthly costs. It&#x27;s not necessarily rational, but for many people if they see they spent $1.26 on YouTube videos in one month and $2.76 in the next month they are going to be annoyed even though they watched a lot more videos that second month.<p>• Some sort of Spotify or Netflix for the Web type thing might work, but as with subscriptions if you have to use more than one of these types of service people will be annoyed.<p>• Another approach would be to make the web version of the site limited, and require using an app for full functionality. A social media site for example might only allow reading on the web, so if you want to post or comment you need to use the app where they have much more control than they do on the web.<p>If ad blocking becomes widespread enough and effective enough that sites do have to switch to some other revenue source it is quite possible that a majority of a politician&#x27;s constituents will in retrospect find that they preferred the ad supported model.<p>Good politicians should be trying to figure out what would make their constituents happiest in the long run and find ways to encourage things to end up that way.<p>In the long run what would probably make most people happy (or rather make them the least unhappy) would be ad supported sites with restrictions on the ads to limit intrusiveness and tracking.<p>[1] For example many people like the ads that run during the Super Bowl in the US. A lot of people with no interest in the football game watch just to see the ads.",
    "time": 1755283138,
    "type": "comment"
  },
  {
    "by": "otabdeveloper4",
    "id": 44743139,
    "kids": [
      44744005,
      44764344
    ],
    "parent": 44741966,
    "text": "&gt; Vibe coding is ultimately about getting ideas shipped faster.<p>Studies show that using LLMs for coding results in negative net productivity gains on average.",
    "time": 1753945330,
    "type": "comment"
  },
  {
    "by": "fragmede",
    "id": 44457321,
    "kids": [
      44457421
    ],
    "parent": 44456904,
    "text": "<a href=\"https:&#x2F;&#x2F;lite.berkeley-humanoid.org&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;lite.berkeley-humanoid.org&#x2F;</a> is only $5000. What&#x27;s the extra $3000 get me?",
    "time": 1751563673,
    "type": "comment"
  },
  {
    "by": "IshKebab",
    "id": 44874971,
    "kids": [
      44875034
    ],
    "parent": 44841891,
    "text": "This asserts that UB was deliberately created for optimisation purposes; not to handle implementation differences. It doesn&#x27;t provide any evidence though and that seems unlikely to me.<p>The spec even says:<p>&gt; behavior, upon use of a <i>nonportable</i> or erroneous program construct or of erroneous data, for which this International Standard imposes no requirements<p>No motivation is given that I could find, so the actual difference between undefined and implementation defined behaviour seems to be based on whether the behaviour needs to be documented.",
    "time": 1754998697,
    "type": "comment"
  },
  {
    "by": "dylanjcastillo",
    "id": 44569969,
    "kids": [
      44570031,
      44578850,
      44570201,
      44569984
    ],
    "parent": 44569619,
    "text": "How do you stay safe from this kind of attacks?",
    "time": 1752578288,
    "type": "comment"
  },
  {
    "by": "kybernetyk",
    "id": 44308264,
    "kids": [
      44310509
    ],
    "parent": 44307295,
    "text": "Yeah there’s also those people who aren’t native speakers. I tend to run ChatGPT over most stuff I write because while writing in English for over 30 years now I still can’t compare to a native speaker.<p>Call it lazy but I think for the reader reading a rephrased LLM article is more enjoyable than trying to parse some borderline “Kauderwelsch”(German for gibberish) :)",
    "time": 1750239871,
    "type": "comment"
  },
  {
    "by": "boringg",
    "descendants": 1,
    "id": 44376236,
    "kids": [
      44377368
    ],
    "score": 1,
    "time": 1750852552,
    "title": "US Administration knocking down data privacy barriers for personal data",
    "type": "story",
    "url": "https://thehill.com/homenews/administration/5366922-trump-data-sharing-privacy-surveillance/"
  },
  {
    "by": "UtopiaPunk",
    "id": 44329667,
    "parent": 44329177,
    "text": "They are very different societies, sure. I don&#x27;t think anyone would argue that point. But China has 1.4 billion people, and yet they have an overabundance of housing. If we are trying to find effective strategies for ending homelessness, that seems like a great situation to study.",
    "time": 1750438601,
    "type": "comment"
  },
  {
    "by": "acron0",
    "id": 44462917,
    "parent": 44461976,
    "text": "I see this sentiment in my colleagues, my friends, my children, everywhere, and it makes me so sad. I want to say something witty and sharp about &quot;neoliberal global capitalism&quot; or something... Weren&#x27;t the successful economic foundations of the west built on hard-working, honest businesses who, in a lot of cases, did it because they felt some connection to their craft and the customers they served? Maybe that&#x27;s just a romantic illusion.",
    "time": 1751621880,
    "type": "comment"
  },
  {
    "by": "z0r",
    "id": 44575390,
    "parent": 44568360,
    "text": "Today I learned that ChatGPT is akin to Seymour Skinner when pressed about the truth of its steamed hams recipe.",
    "time": 1752610611,
    "type": "comment"
  }
]
